comparedDBs/performance_test_scripts/leveldb_scripts/10B_leveldb_YCSB_performance/leveldb_YCSBA_10B_val_128_mem1MB_zipf1.2_random_read.log
base_num: 10000000000
num_entries: 100000000
value_size:128
stats_interval: 10000000
10B
../../../leveldb/release/db_bench --db=/mnt/hotdb_test/level10B/YCSBa_mem1_1.2_iterator2 --num=100000000 --value_size=128 --batch_size=1000 --benchmarks=ycsba,stats --data_file=/home/jeff-wang/workloads/zipf1.2_keys10.0B.csv --logpath=/mnt/logs --bloom_bits=10 --log=1 --cache_size=0 --mem_log_file=/home/jeff-wang/WorkloadAnalysis/comparedDBs/performance_test_scripts/leveldb_scripts/10B_leveldb_zipf_hot_removal/leveldb_memory_usage1MB_10B_key16_val128.log --open_files=40000 --ycsb_num=500000 --compression=0 --stats_interval=10000000 --histogram=1 --write_buffer_size=1048576 --YCSB_data_file=/home/jeff-wang/workloads/random_read_workload1.2.csv --use_existing_db=true --max_file_size=1048576 --print_wa=true
LevelDB:    version 1.23
Date:       Fri Nov 29 12:27:18 2024
CPU:        112 * Intel(R) Xeon(R) Platinum 8180 CPU @ 2.50GHz
CPUCache:   39424 KB
Keys:       16 bytes each
Values:     128 bytes each (64 bytes after compression)
Entries:    100000000
RawSize:    13732.9 MB (estimated)
FileSize:   7629.4 MB (estimated)
WARNING: Optimization is disabled: benchmarks unnecessarily slow
WARNING: Assertions are enabled; benchmarks unnecessarily slow
WARNING: Snappy compression is not enabled
some command parameters have been selected:
  threads: 1
  duration: 0
  print_wa: 1
  num_entries: 100000000
  bechmark selected ycsba,stats
  hot_file_path:
  data_file_path: /home/jeff-wang/workloads/zipf1.2_keys10.0B.csv
  percentages:
------------------------------------------------
open dbs:in Open()
entering db_impl.cc:/mnt/hotdb_test/level10B/YCSBa_mem1_1.2_iterator2
initialize 0 objects(LevelHotColdStats) for 7 levels
Processing 1 entries in every Batch, FLAGS_ycsb_num = 500000
500000 operations have been finished (68.665 MB data have been written into db)
ycsba        :     237.381 micros/op 4212 ops/sec;    0.6 MB/s
Microseconds per op:
Count: 500000  Average: 237.3803  StdDev: 183.60
Percentiles: P50: 209.42 P75: 339.92 P99: 831.14 P99.9: 1522.59 P99.99: 1927.27
------------------------------------------------------
[      30,      35 )      23   0.005%   0.005%
[      35,      40 )   44272   8.854%   8.859% ##
[      40,      45 )   44825   8.965%  17.824% ##
[      45,      50 )    5582   1.116%  18.940%
[      50,      60 )    3690   0.738%  19.678%
[      60,      70 )    2365   0.473%  20.151%
[      70,      80 )    1983   0.397%  20.548%
[      80,      90 )    1879   0.376%  20.924%
[      90,     100 )    1831   0.366%  21.290%
[     100,     120 )    8683   1.737%  23.027%
[     120,     140 )   39450   7.890%  30.917% ##
[     140,     160 )   58227  11.645%  42.562% ##
[     160,     180 )    9020   1.804%  44.366%
[     180,     200 )   20157   4.031%  48.397% #
[     200,     250 )   42527   8.505%  56.903% ##
[     250,     300 )   43961   8.792%  65.695% ##
[     300,     350 )   58270  11.654%  77.349% ##
[     350,     400 )   46216   9.243%  86.592% ##
[     400,     450 )   20088   4.018%  90.610% #
[     450,     500 )   22606   4.521%  95.131% #
[     500,     600 )   14642   2.928%  98.059% #
[     600,     700 )    2864   0.573%  98.632%
[     700,     800 )    1370   0.274%  98.906%
[     800,     900 )    1506   0.301%  99.207%
[     900,    1000 )    1100   0.220%  99.427%
[    1000,    1200 )    1197   0.239%  99.667%
[    1200,    1400 )     835   0.167%  99.834%
[    1400,    1600 )     540   0.108%  99.942%
[    1600,    1800 )     199   0.040%  99.982%
[    1800,    2000 )      66   0.013%  99.995%
[    2000,    2500 )      17   0.003%  99.998%
[    3500,    4000 )       1   0.000%  99.998%
[    4000,    4500 )       1   0.000%  99.999%
[    4500,    5000 )       1   0.000%  99.999%
[    5000,    6000 )       1   0.000%  99.999%
[    7000,    8000 )       1   0.000%  99.999%
[    9000,   10000 )       1   0.000%  99.999%
[   10000,   12000 )       2   0.000% 100.000%
[   30000,   35000 )       1   0.000% 100.000%

entering io_statistics1

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  1        1        0         0        0         0
  2       17        3         0        0         0
  3      200      181         0        0         0
  4     6188     5960         0        0         0
user_io:0.000MB total_ios: 0.000MB WriteAmplification: -nan



Disk nvme0n1: Read: 2378106 MB | Write: 74599926 MB
Disk nvme0n1: Read: 0 MB | Write: 0 MB
Disk nvme0n1: Read: 0 MB | Write: 0 MB
Disk nvme0n1: Read: 0 MB | Write: 0 MB
Disk nvme0n1: Read: 89 MB | Write: 0 MB
Disk nvme0n1: Read: 127 MB | Write: 0 MB
Disk nvme0n1: Read: 47 MB | Write: 0 MB
Disk nvme0n1: Read: 46 MB | Write: 0 MB
Disk nvme0n1: Read: 49 MB | Write: 0 MB
Disk nvme0n1: Read: 53 MB | Write: 0 MB
Disk nvme0n1: Read: 51 MB | Write: 0 MB
Disk nvme0n1: Read: 53 MB | Write: 0 MB
Disk nvme0n1: Read: 53 MB | Write: 0 MB
Disk nvme0n1: Read: 48 MB | Write: 0 MB
Disk nvme0n1: Read: 49 MB | Write: 0 MB
Disk nvme0n1: Read: 50 MB | Write: 0 MB
Disk nvme0n1: Read: 47 MB | Write: 0 MB
Disk nvme0n1: Read: 46 MB | Write: 0 MB
Disk nvme0n1: Read: 45 MB | Write: 0 MB
Disk nvme0n1: Read: 45 MB | Write: 0 MB
Disk nvme0n1: Read: 42 MB | Write: 0 MB
Disk nvme0n1: Read: 42 MB | Write: 0 MB
Disk nvme0n1: Read: 40 MB | Write: 0 MB
Disk nvme0n1: Read: 40 MB | Write: 0 MB
Disk nvme0n1: Read: 38 MB | Write: 0 MB
Disk nvme0n1: Read: 37 MB | Write: 0 MB
Disk nvme0n1: Read: 36 MB | Write: 0 MB
Disk nvme0n1: Read: 37 MB | Write: 0 MB
Disk nvme0n1: Read: 33 MB | Write: 0 MB
Disk nvme0n1: Read: 35 MB | Write: 0 MB
Disk nvme0n1: Read: 31 MB | Write: 0 MB
Disk nvme0n1: Read: 31 MB | Write: 0 MB
Disk nvme0n1: Read: 31 MB | Write: 0 MB
Disk nvme0n1: Read: 30 MB | Write: 0 MB
Disk nvme0n1: Read: 30 MB | Write: 0 MB
Disk nvme0n1: Read: 29 MB | Write: 0 MB
Disk nvme0n1: Read: 30 MB | Write: 0 MB
Disk nvme0n1: Read: 30 MB | Write: 0 MB
Disk nvme0n1: Read: 31 MB | Write: 0 MB
Disk nvme0n1: Read: 28 MB | Write: 0 MB
Disk nvme0n1: Read: 29 MB | Write: 0 MB
Disk nvme0n1: Read: 29 MB | Write: 0 MB
Disk nvme0n1: Read: 29 MB | Write: 0 MB
Disk nvme0n1: Read: 30 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 28 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 29 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 28 MB | Write: 0 MB
Disk nvme0n1: Read: 28 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 28 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
[...]
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 25 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 25 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 25 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 25 MB | Write: 0 MB
Disk nvme0n1: Read: 25 MB | Write: 0 MB
Disk nvme0n1: Read: 25 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 25 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 25 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
[...]
Disk nvme0n1: Read: 28 MB | Write: 0 MB
Disk nvme0n1: Read: 28 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 25 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 28 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
[...]
Disk nvme0n1: Read: 28 MB | Write: 0 MB
Disk nvme0n1: Read: 28 MB | Write: 0 MB
Disk nvme0n1: Read: 21 MB | Write: 0 MB
Disk nvme0n1: Read: 0 MB | Write: 0 MB
Disk nvme0n1: Read: 0 MB | Write: 0 MB
Disk nvme0n1: Read: 0 MB | Write: 0 MB
[...]